Repository: smartcommunitylab/dslab.playgo-mobile
Catalog: playgo-mobile/ios/App/App/*.lproj/InfoPlist.strings
Languages: it

# NSMotionUsageDescription
source: This app requires motion detection access to minimize battery consumption by accessing to your location information only when moving.
it: L’applicazione necessita di accedere alla motion detection (rilevazione di movimento) per minimizzare il consumo di batteria ed attivare la geo-localizzazione solo al bisogno.

# NSLocationWhenInUseUsageDescription
source: This app requires access to your location to track, validate and reward your trips.
it: L’applicazione necessita di accedere alle informazioni relative alla tua posizione per poter tracciare, validare e premiare i tuoi spostamenti sostenibili.

# NSLocationAlwaysAndWhenInUseUsageDescription
source: When tracking a trip, this app requires constant access to your location in order to track your position, even when the screen is off or the app is in the background.
it: Durante il tracciamento del viaggio l'applicazione necessita di accesso costante alla posizione, anche quando lo schermo non è attivo e l'applicazione è in background.

# NSLocationAlwaysUsageDescription
source: When tracking a trip, this app requires constant access to your location in order to track your position, even when the screen is off or the app is in the background.
it: Durante il tracciamento del viaggio l'applicazione necessita di accesso costante alla posizione, anche quando lo schermo non è attivo e l'applicazione è in background.

# NSContactsUsageDescription
source: This application requires access your contacts
it: Questa applicazione richiede l'accesso ai tuoi contatti

# NSCalendarsUsageDescription
source: This application requires access your calendar
it: Questa applicazione richiede l'accesso al tuo calendario

# NSPhotoLibraryUsageDescription
source: This app would like to save photos to your photo gallery for choosing your profile photo
it: Questa applicazione richiede l'accesso alla tua galleria di immagini

# NSBluetoothPeripheralUsageDescription
source: This app requires bluetooth access to localise and certificate your journeys
it: Questa applicazione richiede l'accesso alla connessione Bluetooth per localizzare e certificare i tuoi viaggi

# NSMicrophoneUsageDescription
source: This application requires access your microphone
it: Questa applicazione richiede l'accesso al microfono

# NSBluetoothAlwaysUsageDescription
source: This app requires bluetooth access to localise and certificate your journeys
it: Questa applicazione richiede l'accesso alla connessione Bluetooth per localizzare e certificare i tuoi viaggi
